In [1]:
import numpy as np
import pandas as pd
import seaborn as sns

In [2]:
iris = sns.load_dataset('iris')

In [3]:
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [6]:
s = pd.Series(np.random.rand(5), index=list('abcde'))
s

a    0.333326
b    0.989237
c    0.326530
d    0.939229
e    0.404878
dtype: float64

In [7]:
s.reindex(list('qwert'))

q         NaN
w         NaN
e    0.404878
r         NaN
t         NaN
dtype: float64

In [8]:
# reindex just reforms
s.reindex(list('zaxbtc'))

z         NaN
a    0.333326
x         NaN
b    0.989237
t         NaN
c    0.326530
dtype: float64

In [9]:
s.index = list('qwrty')

In [10]:
s

q    0.333326
w    0.989237
r    0.326530
t    0.939229
y    0.404878
dtype: float64

In [11]:
df = pd.DataFrame(
    {
        "one": pd.Series(np.random.randn(3), index=["a", "b", "c"]),
        "two": pd.Series(np.random.randn(4), index=["a", "b", "c", "d"]),
        "three": pd.Series(np.random.randn(3), index=["b", "c", "d"]),
    }
)
df

        one       two     three
a -0.047232 -1.135176       NaN
b -0.428159 -0.533535 -0.057098
c  1.669128  0.590839 -0.049013
d       NaN -0.343111 -1.064254

In [12]:
df.reindex(index=list('daf'), columns=['three', 'one', 'two'])

      three       one       two
d -1.064254       NaN -0.343111
a       NaN -0.047232 -1.135176
f       NaN       NaN       NaN

In [13]:
df.reindex(['a', 'one'], axis=0)

          one       two  three
a   -0.047232 -1.135176    NaN
one       NaN       NaN    NaN

In [14]:
df.reindex(['a', 'one'], axis=1)

    a       one
a NaN -0.047232
b NaN -0.428159
c NaN  1.669128
d NaN       NaN

In [15]:
df.reindex(['a', 'one'], axis='columns')

    a       one
a NaN -0.047232
b NaN -0.428159
c NaN  1.669128
d NaN       NaN

In [16]:
df.reindex(['a', 'one'], axis='rows')

          one       two  three
a   -0.047232 -1.135176    NaN
one       NaN       NaN    NaN

In [17]:
s.reindex(df.index)

a   NaN
b   NaN
c   NaN
d   NaN
dtype: float64

In [18]:
s.index is df.index

False

In [20]:
df.reindex_like(
    df.reindex(['a', 'one'])
)

          one       two  three
a   -0.047232 -1.135176    NaN
one       NaN       NaN    NaN

In [21]:
df

        one       two     three
a -0.047232 -1.135176       NaN
b -0.428159 -0.533535 -0.057098
c  1.669128  0.590839 -0.049013
d       NaN -0.343111 -1.064254

In [23]:
df2 = df.reindex(['a', 'one'])
df2

          one       two  three
a   -0.047232 -1.135176    NaN
one       NaN       NaN    NaN

In [24]:
df + df2

          one       two  three
a   -0.094464 -2.270353    NaN
b         NaN       NaN    NaN
c         NaN       NaN    NaN
d         NaN       NaN    NaN
one       NaN       NaN    NaN

In [25]:
s

q    0.333326
w    0.989237
r    0.326530
t    0.939229
y    0.404878
dtype: float64

In [26]:
s1 = s[:4]
s1

q    0.333326
w    0.989237
r    0.326530
t    0.939229
dtype: float64

In [27]:
s2 = s[1:]
s2

w    0.989237
r    0.326530
t    0.939229
y    0.404878
dtype: float64

In [28]:
s1 + s2

q         NaN
r    0.653060
t    1.878458
w    1.978474
y         NaN
dtype: float64

In [34]:
s1.align(s2)

(q    0.333326
 r    0.326530
 t    0.939229
 w    0.989237
 y         NaN
 dtype: float64,
 q         NaN
 r    0.326530
 t    0.939229
 w    0.989237
 y    0.404878
 dtype: float64)

In [35]:
s1.align(s2, join='inner')

(w    0.989237
 r    0.326530
 t    0.939229
 dtype: float64,
 w    0.989237
 r    0.326530
 t    0.939229
 dtype: float64)

In [32]:
s1.align(s2, join='outer')

(q    0.333326
 r    0.326530
 t    0.939229
 w    0.989237
 y         NaN
 dtype: float64,
 q         NaN
 r    0.326530
 t    0.939229
 w    0.989237
 y    0.404878
 dtype: float64)

In [36]:
s1.align(s2, join='left')

(q    0.333326
 w    0.989237
 r    0.326530
 t    0.939229
 dtype: float64,
 q         NaN
 w    0.989237
 r    0.326530
 t    0.939229
 dtype: float64)

In [37]:
s1.align(s2, join='right')

(w    0.989237
 r    0.326530
 t    0.939229
 y         NaN
 dtype: float64,
 w    0.989237
 r    0.326530
 t    0.939229
 y    0.404878
 dtype: float64)

In [39]:
df.align(df2, join='inner', axis=0)

(        one       two  three
 a -0.047232 -1.135176    NaN,
         one       two  three
 a -0.047232 -1.135176    NaN)

In [40]:
df.align(df2, join='inner', axis=1)

(        one       two     three
 a -0.047232 -1.135176       NaN
 b -0.428159 -0.533535 -0.057098
 c  1.669128  0.590839 -0.049013
 d       NaN -0.343111 -1.064254,
           one       two  three
 a   -0.047232 -1.135176    NaN
 one       NaN       NaN    NaN)

In [41]:
df.align(df2, join='inner', axis='rows')

(        one       two  three
 a -0.047232 -1.135176    NaN,
         one       two  three
 a -0.047232 -1.135176    NaN)

In [45]:
df.align(s, axis='columns')

(        one   q   r   t     three       two   w   y
 a -0.047232 NaN NaN NaN       NaN -1.135176 NaN NaN
 b -0.428159 NaN NaN NaN -0.057098 -0.533535 NaN NaN
 c  1.669128 NaN NaN NaN -0.049013  0.590839 NaN NaN
 d       NaN NaN NaN NaN -1.064254 -0.343111 NaN NaN,
 one           NaN
 q        0.333326
 r        0.326530
 t        0.939229
 three         NaN
 two           NaN
 w        0.989237
 y        0.404878
 dtype: float64)

In [46]:
# Missing value handling

In [47]:
rng = pd.date_range('1/3/2022', periods=8)
rng

DatetimeIndex(['2022-01-03', '2022-01-04', '2022-01-05', '2022-01-06',
               '2022-01-07', '2022-01-08', '2022-01-09', '2022-01-10'],
              dtype='datetime64[ns]', freq='D')

In [48]:
rng = pd.date_range('1/3/2022', periods=8, freq='D')
rng

DatetimeIndex(['2022-01-03', '2022-01-04', '2022-01-05', '2022-01-06',
               '2022-01-07', '2022-01-08', '2022-01-09', '2022-01-10'],
              dtype='datetime64[ns]', freq='D')

In [49]:
ts = pd.Series(np.random.rand(8), index=rng)
ts

2022-01-03    0.212556
2022-01-04    0.491735
2022-01-05    0.606190
2022-01-06    0.632736
2022-01-07    0.941223
2022-01-08    0.259513
2022-01-09    0.150314
2022-01-10    0.410544
Freq: D, dtype: float64

In [50]:
ts2 = ts[[0, 3, 6]]
ts2

C:\Users\Amir\AppData\Local\Temp\ipykernel_8648\1468723464.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ts2 = ts[[0, 3, 6]]

2022-01-03    0.212556
2022-01-06    0.632736
2022-01-09    0.150314
Freq: 3D, dtype: float64

In [51]:
ts2.reindex(ts.index)

2022-01-03    0.212556
2022-01-04         NaN
2022-01-05         NaN
2022-01-06    0.632736
2022-01-07         NaN
2022-01-08         NaN
2022-01-09    0.150314
2022-01-10         NaN
Freq: D, dtype: float64

In [52]:
ts2.reindex(ts.index, method='ffill') # method is for filling null values

2022-01-03    0.212556
2022-01-04    0.212556
2022-01-05    0.212556
2022-01-06    0.632736
2022-01-07    0.632736
2022-01-08    0.632736
2022-01-09    0.150314
2022-01-10    0.150314
Freq: D, dtype: float64

In [53]:
# ffill = forward fill

In [54]:
ts2.reindex(ts.index, method='bfill') # backward fill

2022-01-03    0.212556
2022-01-04    0.632736
2022-01-05    0.632736
2022-01-06    0.632736
2022-01-07    0.150314
2022-01-08    0.150314
2022-01-09    0.150314
2022-01-10         NaN
Freq: D, dtype: float64

In [55]:
ts2.reindex(ts.index, method='nearest')

2022-01-03    0.212556
2022-01-04    0.212556
2022-01-05    0.632736
2022-01-06    0.632736
2022-01-07    0.632736
2022-01-08    0.150314
2022-01-09    0.150314
2022-01-10    0.150314
Freq: D, dtype: float64

In [57]:
ts2.reindex(ts.index).fillna(method='ffill')

C:\Users\Amir\AppData\Local\Temp\ipykernel_8648\3718153.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  ts2.reindex(ts.index).fillna(method='ffill')

2022-01-03    0.212556
2022-01-04    0.212556
2022-01-05    0.212556
2022-01-06    0.632736
2022-01-07    0.632736
2022-01-08    0.632736
2022-01-09    0.150314
2022-01-10    0.150314
Freq: D, dtype: float64

In [58]:
ts2.reindex(ts.index).fillna(5)

2022-01-03    0.212556
2022-01-04    5.000000
2022-01-05    5.000000
2022-01-06    0.632736
2022-01-07    5.000000
2022-01-08    5.000000
2022-01-09    0.150314
2022-01-10    5.000000
Freq: D, dtype: float64

In [59]:
ts2.reindex(ts.index).fillna(ts.mean())

2022-01-03    0.212556
2022-01-04    0.463101
2022-01-05    0.463101
2022-01-06    0.632736
2022-01-07    0.463101
2022-01-08    0.463101
2022-01-09    0.150314
2022-01-10    0.463101
Freq: D, dtype: float64

In [60]:
df

        one       two     three
a -0.047232 -1.135176       NaN
b -0.428159 -0.533535 -0.057098
c  1.669128  0.590839 -0.049013
d       NaN -0.343111 -1.064254

In [61]:
df.drop(['a', 'b'])

        one       two     three
c  1.669128  0.590839 -0.049013
d       NaN -0.343111 -1.064254

In [62]:
df.drop(['a', 'b'], axis='rows')

        one       two     three
c  1.669128  0.590839 -0.049013
d       NaN -0.343111 -1.064254

In [63]:
df.drop(['a', 'b'], axis=0)

        one       two     three
c  1.669128  0.590839 -0.049013
d       NaN -0.343111 -1.064254

In [64]:
df.drop(['a', 'bbbbb'], axis='rows')

KeyError: "['bbbbb'] not found in axis"

In [65]:
df.drop(['a', 'bbbbb'], axis='rows', errors='ignore')

        one       two     three
b -0.428159 -0.533535 -0.057098
c  1.669128  0.590839 -0.049013
d       NaN -0.343111 -1.064254

In [68]:
df.drop(columns=['one'])

        two     three
a -1.135176       NaN
b -0.533535 -0.057098
c  0.590839 -0.049013
d -0.343111 -1.064254

In [71]:
df.rename(lambda x: x)

        one       two     three
a -0.047232 -1.135176       NaN
b -0.428159 -0.533535 -0.057098
c  1.669128  0.590839 -0.049013
d       NaN -0.343111 -1.064254

In [72]:
df.rename(str.upper)

        one       two     three
A -0.047232 -1.135176       NaN
B -0.428159 -0.533535 -0.057098
C  1.669128  0.590839 -0.049013
D       NaN -0.343111 -1.064254

In [73]:
df.rename(str.strip)

        one       two     three
a -0.047232 -1.135176       NaN
b -0.428159 -0.533535 -0.057098
c  1.669128  0.590839 -0.049013
d       NaN -0.343111 -1.064254

In [74]:
df.rename(str.title)

        one       two     three
A -0.047232 -1.135176       NaN
B -0.428159 -0.533535 -0.057098
C  1.669128  0.590839 -0.049013
D       NaN -0.343111 -1.064254

In [75]:
df.rename(columns=str.upper)

        ONE       TWO     THREE
a -0.047232 -1.135176       NaN
b -0.428159 -0.533535 -0.057098
c  1.669128  0.590839 -0.049013
d       NaN -0.343111 -1.064254

In [76]:
df.rename(columns=str.upper, index=str.strip)

        ONE       TWO     THREE
a -0.047232 -1.135176       NaN
b -0.428159 -0.533535 -0.057098
c  1.669128  0.590839 -0.049013
d       NaN -0.343111 -1.064254

In [79]:
df.rename(columns={
    'one': 'OLENEME',
})

    OLENEME       two     three
a -0.047232 -1.135176       NaN
b -0.428159 -0.533535 -0.057098
c  1.669128  0.590839 -0.049013
d       NaN -0.343111 -1.064254

In [80]:
df.rename(columns={
    'one': 'OLENEME',
}, index={
    'a': 'Mahhahahahahhahasa',
})

                     OLENEME       two     three
Mahhahahahahhahasa -0.047232 -1.135176       NaN
b                  -0.428159 -0.533535 -0.057098
c                   1.669128  0.590839 -0.049013
d                        NaN -0.343111 -1.064254

In [81]:
df.rename(
    {'a': 'YU'},
    axis='rows'
)

         one       two     three
YU -0.047232 -1.135176       NaN
b  -0.428159 -0.533535 -0.057098
c   1.669128  0.590839 -0.049013
d        NaN -0.343111 -1.064254

In [83]:
s.rename('TESTiiiing')

q    0.333326
w    0.989237
r    0.326530
t    0.939229
y    0.404878
Name: TESTiiiing, dtype: float64

In [84]:
s

q    0.333326
w    0.989237
r    0.326530
t    0.939229
y    0.404878
dtype: float64

In [85]:
s.name = 'hadis'

In [86]:
s

q    0.333326
w    0.989237
r    0.326530
t    0.939229
y    0.404878
Name: hadis, dtype: float64